In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:1234@localhost/test

In [2]:
%%sql
drop table if exists Employees;
CREATE TABLE Employees (
  EmployeeID INT PRIMARY KEY,
  FirstName VARCHAR(50),
  LastName VARCHAR(50)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.

[]

In [3]:
%%sql
alter table employees
add email varchar(100);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [13]:
%%sql
desc empdet;

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('EmployeeID', 'int', 'NO', 'PRI', None, ''),
 ('FirstName', 'varchar(50)', 'YES', '', None, ''),
 ('email', 'varchar(100)', 'YES', '', None, '')]

In [11]:
%%sql
alter table employees drop column Lastname;

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1146 (42S02): Table 'test.employees' doesn't exist
[SQL: alter table employees drop column Lastname;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [15]:
%%sql
alter table empdet rename to employees;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]